##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


### 교차상관 (Cross Correlation) 분석사례: ccf


# 1,2 절의 우연변동 시계열 자료(dd1), 계절변동(dd2)에 대하여 교차상관 수행.

library(forecast)
library(tsDyn)
library(tseries)


dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,                                          # 우연변동 시계열자료(dd1)
               1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
               1254, 1289, 1497, 1208))


dd1.ts = ts(data=dd1, start=c(2006,1), frequency=4)                                                    # 4 분기 설정해서 display.
dd1.ts

dd2 = matrix(c(1142, 1242, 1452, 1543,  1125, 1262, 1456,1572,                                         # 계절변동 시계열자료(dd2)
               1143, 1259, 1462, 1553,  1121, 1258, 1472, 1546,
               1154, 1249, 1477, 1548))

dd2.ts = ts(data=dd2, start=c(2006,1), frequency=4)                                                    # 4 분기 설정해서 display.
dd2.ts




(dd.ts=ts(data=cbind(dd1,dd2,dd4),s=c(2006,1),f=4))

plot(ccf(dd.ts[,1], dd.ts[,2]), main = "Cross Correlation Plot : dd1-dd2")

plot(ccf(dd.ts[,2], dd.ts[,3]), main = "Cross Correlation Plot : dd2-dd4")


graphics.off()                                                                                          # 그래프를 지워주는 함수.


#  분석결과:

# dd1-dd2 시계열 자료가 신뢰구간 95%의 범위 내에 존재하여 교차상관은 존재하지 않는 것으로 판단.
# 두 자료의 Pearson 상관계수 r=0.036으로 분석.
# dd2-dd4 시계열 자료는 교차상관이 존재.


############################################################결과값(print)#################################################################

# # > library(forecast)
# Registered S3 method overwritten by 'quantmod':
#   method            from
# as.zoo.data.frame zoo 
# > library(tsDyn)
# > library(tseries)
# 
# ‘tseries’ version: 0.10-47
# 
# ‘tseries’ is a package for time series analysis and computational finance.
# 
# See ‘library(help="tseries")’ for details.
# 
# > dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,                                          # 우연변동 시계열자료(dd1)
#                  +                1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
#                  +                1254, 1289, 1497, 1208))
# > 
#   > 
#   > dd1.ts = ts(data=dd1, start=c(2006,1), frequency=4)                                                    # 4 분기 설정해서 display.
# > dd1.ts
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208
# > dd2 = matrix(c(1142, 1242, 1452, 1543,  1125, 1262, 1456,1572,                                         # 계절변동 시계열자료(dd2)
#                  +                1143, 1259, 1462, 1553,  1121, 1258, 1472, 1546,
#                  +                1154, 1249, 1477, 1548))
# > 
#   > dd2.ts = ts(data=dd2, start=c(2006,1), frequency=4)                                                    # 4 분기 설정해서 display.
# 
# > dd2.ts
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1142 1242 1452 1543
# 2007 1125 1262 1456 1572
# 2008 1143 1259 1462 1553
# 2009 1121 1258 1472 1546
# 2010 1154 1249 1477 1548
# 
# > (dd.ts=ts(data=cbind(dd1,dd2,dd4),s=c(2006,1),f=4))
# Series 1 Series 2 Series 3
# 2006 Q1     1342     1142     1142
# 2006 Q2     1442     1242     1242
# 2006 Q3     1252     1452     1452
# 2006 Q4     1343     1543     1543
# 2007 Q1     1425     1125     1225
# 2007 Q2     1362     1262     1362
# 2007 Q3     1456     1456     1556
# 2007 Q4     1272     1572     1672
# 2008 Q1     1243     1143     1343
# 2008 Q2     1359     1259     1459
# 2008 Q3     1412     1462     1662
# 2008 Q4     1253     1553     1753
# 2009 Q1     1201     1121     1421
# 2009 Q2     1478     1258     1558
# 2009 Q3     1322     1472     1772
# 2009 Q4     1406     1546     1846
# 2010 Q1     1254     1154     1554
# 2010 Q2     1289     1249     1649
# 2010 Q3     1497     1477     1877
# 2010 Q4     1208     1548     1948
# > plot(ccf(dd.ts[,1], dd.ts[,2]), main = "Cross Correlation Plot : dd1-dd2")
# > 
#   > plot(ccf(dd.ts[,2], dd.ts[,3]), main = "Cross Correlation Plot : dd2-dd4")
# 
# > graphics.off() 



##########################################################################################################################################