##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


### 추세검정에 관한 분석 사례: Trend Test-Spearman p test

# 시계열 자료의 추세여부의 검정은, 비모수 분석기업인 spearman상관계수 p test를 적용.
# Spearman의 상관계수 p test는 시간과 조사자료의 순위에 대한 상관관계를 토대로 추세를 파악하는데 적용. 



library(forecast)
library(tsDyn)
library(tseries)


# dd2 = matrix(c(1142, 1242, 1452, 1543,  1125, 1262, 1456,1572,                                          # 계절변동 시계열자료(dd2)
#                1143, 1259, 1462, 1553,  1121, 1258, 1472, 1546,
#                1154, 1249, 1477, 1548))
# 
# 
# dd2.ts = ts(data=dd1, start=c(2006,1), frequency=4)                                                    # 4 분기 설정해서 display.

# dd2.ts

# 분석자료 우연변동 시계열(dd1) 및 계절 , 추세변동의 시계열(dd4)

tt<-seq(1:20)                                                                                           # 시간자료 변환.

rr1=rank(dd1)                                                                                           # dd1 자료 순위

rr2=rank(dd4)                                                                                           # dd4 자료 순위

(cbind(tt,rr1,rr2))                                                                                     # 입력자료 출력.

cor.test(tt,rr1, method=c("spearman"))                                                                  # dd1 상관성 검정.

cor.test(tt,rr2, method = c("spearman"))                                                                # dd4 상관성 검정.


graphics.off()                                                                                          # 그래프를 지워주는 함수.

# Trend test 검정결과:
# 입력자료는 시간 "tt"와 조사자료 순위 "rr1", "rr2"로 구성.
# 순위는 rank로 산정.
 
# 시간과 조사자료 순위에 대한 상관분석 결과, 우연변동 시계열 자료 "dd1"  는 p=-0.13, p=0.57로서 시간과 순위가 독립이라는 귀무가설.
# 기각을 할 수 없음. 이에 따라 시계열 자료에 추세가 없고 정상성이 존재한다고 판단.

# 그러나 계절, 추세변동자료"dd4"는 p=0.76, p=0.0001로서 시간과 순위가 독립이라는 귀무가설을 기각하며 추세가 존재한다고 판단.


############################################################결과값(print)#################################################################

# # # > [Workspace loaded from ~/.RData]

# > tt<-seq(1:20)

# > rr1=rank(dd1)

# > 
# > rr2=rank(dd4)
# > (cbind(tt,rr1,rr2))
# tt rr1 rr2
# [1,]  1  10   1
# [2,]  2  17   3
# [3,]  3   4   7
# [4,]  4  11   9
# [5,]  5  16   2
# [6,]  6  13   5
# [7,]  7  18  11
# [8,]  8   7  15
# [9,]  9   3   4
# [10,] 10  12   8
# [11,] 11  15  14
# [12,] 12   5  16
# [13,] 13   1   6
# [14,] 14  19  12
# [15,] 15   9  17
# [16,] 16  14  18
# [17,] 17   6  10
# [18,] 18   8  13
# [19,] 19  20  19
# [20,] 20   2  20
# > cor.test(tt,rr1, method=c("spearman"))
# 
# Spearman's rank correlation rho
# 
# data:  tt and rr1
# S = 1508, p-value = 0.5725
# alternative hypothesis: true rho is not equal to 0
# sample estimates:
#        rho 
# -0.1338346 
# 
# > 
# > cor.test(tt,rr2, method = c("spearman"))
# 
# 	Spearman's rank correlation rho
# 
# data:  tt and rr2
# S = 306, p-value = 0.000108
# alternative hypothesis: true rho is not equal to 0
# sample estimates:
#   rho 
# 0.7699248 


##########################################################################################################################################