##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


### 독립성 검정: Box Test(Box-Pierce, Ljung Box)

# 시계열 자료의 독립성 검정은 Box Test를 적용. 
# 이는 portmanteau 검정으로도 불림.


library(forecast)
library(tsDyn)
library(tseries)

Box.test(dd1, t=c("B"))

Box.test(dd4, t=c("B"))

Box.test(dd1, t=c("L"))

Box.test(dd4, t=c("L"))



graphics.off()                                                                                          # 그래프를 지워주는 함수.


# 독립성 검정결과

# 검정결과 우연변동 시계열 dd1은 , Box-Pierce Test의 검정통계량은 x^2=2.17, p=0.14, Box-Ljung Test의 검정통계량은 x^2=2.519, p=0.11로 산정.

# 이에 따라 시계열 자료 dd1은 독립이며, 자기상관이 없다는 귀무가설을 기각할 수 없음.

# 계절변동과 추세변동 시계열 자료 dd4는 , Box-Pierce Test의 검정 통계량은 x^2=4.00, p=0.04, Box-Ljung Test 검정통계량은 x^2=4.64, p=0.03
# 으로 산정.

# 이에 따라서 시계열 자료 dd4는 독립이며, 자기상관이 없다는 귀무가설을 기각. 즉 자기상관이 존재하는 것으로 분석석



############################################################결과값(print)#################################################################

# # #>> Box.test(dd1, t=c("B"))
# 
# Box-Pierce test
# 
# data:  dd1
# X-squared = 2.1755, df = 1, p-value = 0.1402
# 
# > 
#   > Box.test(dd4, t=c("B"))
# 
# Box-Pierce test
# 
# data:  dd4
# X-squared = 4.0074, df = 1, p-value = 0.0453
# 
# > 
#   > Box.test(dd1, t=c("L"))
# 
# Box-Ljung test
# 
# data:  dd1
# X-squared = 2.519, df = 1, p-value = 0.1125
# 
# > 
#   > Box.test(dd4, t=c("L"))
# 
# Box-Ljung test
# 
# data:  dd4
# X-squared = 4.6402, df = 1, p-value = 0.03123

# 

##########################################################################################################################################