##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


###  정상근(단위근) 검정 : Unit Root Test (PP.test)

# 시계열 자료가 다음 수식으로 구성될 때, 단위근(Unit Root), |α|=1이 존재하는가 여부를 파악하여, 시계열 자료가 차분(difference)
# 을 가지는지 여부를 파악하게 됨.

# 만일, 시계열 자료에 단위근이 존재한다는 귀무가설이 채택되면 (|α|=1), 시계열 자료는 차분이 필요한 것으로 판단되며, 귀무가설이 기각되면
# 차분이 필요 없는 정상 시계열로 판단. 

# (The null hypothesis is that x has a unit root against a stationary root alternative.)

# 단위근 검정은 "단위근 |α|=1 이 존재한다는 가설검정으로, 1970년대 Dickey-Fuller에 의해 제안됨.


library(forecast)
library(tsDyn)
library(tseries)

dd1

pp.test(dd1)


graphics.off()                                                                                          # 그래프를 지워주는 함수.

# 분석결과:

# 우연변동의 시계열 자료는 "dd1"의 단위근 검정결과, 검정통계량 Dickey-Fuller Z(Alpha) 검정통계량= -21.95, p=0.013로서,
# 시계열 자료의 단위근 이 존재한다는 귀무가설을 기각.

# 즉 우연변동 시계열 "dd1"은 차분이 필요 없는 정상 시계열로 판단.
# 분석결과, p=-0.013 < α=0.05 로서 귀무가설 기각, "alternative hypothesis: stationary"와 같이 시계열 자료 dd1은 정상 시계열 (stationary)


############################################################결과값(print)#################################################################

# # # 
# > library(forecast)
# > library(tsDyn)
# > library(tseries)
# 
# > dd1
# [,1]
# [1,] 1342
# [2,] 1442
# [3,] 1252
# [4,] 1343
# [5,] 1425
# [6,] 1362
# [7,] 1456
# [8,] 1272
# [9,] 1243
# [10,] 1359
# [11,] 1412
# [12,] 1253
# [13,] 1201
# [14,] 1478
# [15,] 1322
# [16,] 1406
# [17,] 1254
# [18,] 1289
# [19,] 1497
# [20,] 1208
# 
# > pp.test(dd1)
# 
# Phillips-Perron Unit Root Test
# 
# data:  dd1
# Dickey-Fuller Z(alpha) = -21.954, Truncation lag parameter = 2, p-value = 0.01315
# alternative hypothesis: stationary


##########################################################################################################################################