##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


###  시계열 자료의 이상값 여부 검정.

# 시계열 자료의 이상값 여부, 
# 즉 측정된 자료가 극단값인지의 여부를 검정하는 방법
# 검정결과 극단값으로 판정되면, 이를 보정하거나 적절한 조치를 적용하여 분석을 수행.


# thompson 통계량
# 자유도 n-2, α 유의수준의 T 기각역을 초과하면 극단값으로 판정
# 10개의 측정값의 검정여부 판정



library(forecast)
library(tsDyn)
library(tseries)


x = c(1,2,3,4,5,6,7,8,9,15)

tom = function(x){                                                                                       # Tomson 검정통계량
  nn=length(x)
  mu=mean(x)
  ss=sd(x,1)
  t1=(x - mu)/ss
  (sqrt(nn-2)*t1)/(sqrt(nn-1-t1*t1))}

tt1 = qt(0.99,8)                                                                                        # α = 0.01 기각역
tt2 = qt(0.95,8)                                                                                        # α = 0.05 기각역  

tom(x); 
tt1; 
tt2;



graphics.off()                                                                                          # 그래프를 지워주는 함수.




# 검정결과

# 검정결과 관측값 "15"는 검정통계량 3.0645로서 α = 0.01 , α = 0.05 기각역을 초과하여 , 95 % 99 % 유의수준으로 극단값 판단.

############################################################결과값(print)#################################################################

# [Workspace loaded from ~/.RData]

 
# > library(forecast)
# > library(tsDyn)
# > library(tseries)

# > x = c(1,2,3,4,5,6,7,8,9,15)

# # > tom = function(x){
# +   nn=length(x)
# +   mu=mean(x)
# +   ss=sd(x,1)
# +   t1=(x - mu)/ss
# +   (sqrt(nn-2)*t1)/(sqrt(nn-1-t1*t1))}

# > tt1 = qt(0.99,8)

# > tt2 = qt(0.95,8)

# > tom(x); 
# [1] -1.2649111 -0.9773556 -0.7145896 -0.4681646 -0.2317138  0.0000000  0.2317138  0.4681646  0.7145896  3.0645235

# > tt1; 
# [1] 2.896459

# > tt2;
# [1] 1.859548




##########################################################################################################################################