##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


###  시계열 자료의 일부에 대한 정상성 검정.

# 자료 package TSA에서 "beersales" 자료에서 7월 자료 추출

# 검정결과 : 유의확률 p = 0.01 < 0.05 , 정상시계열이 아닌 것으로 판단.


library(forecast)
library(tsDyn)
library(tseries)
library(mice)

install.packages("TSA")


beer


graphics.off()                                                                                          # 그래프를 지워주는 함수.



############################################################결과값(print)#################################################################

# [Workspace loaded from ~/.RData]




##########################################################################################################################################