##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### 시계열 데이터의 자료 형태.

## 영구적 변화의 우연변동 시계열(Permanent Change Random Variable Time Series)

# 시계열 자료가 영구적으로 변화하며, 변화된 상태에서의 우연변동(Random Variation) 또는 계절변동(Seasonal Variation)을 보여주은 시계열 형태.
# 영구적 변화에서 수식의 계수들은 미지의 모수로 시계열 자료에서 추정.
# 분석사례는 영구적 변화에 따른 우연변동을 수행하였으나, 분석자료에 따라서 영구적변화에 따른 추세변동, 계절변동 등 다양한 시계열로 표현.


.libPaths("C://Users//yjang//R")    # 저장 디렉토리 및 lib 경로 설정.


dd6 = matrix(c(1342, 1442, 1252, 1343,   1425, 1362, 1456, 1272,
               1243, 1359, 1812, 1653,   1601, 1878, 1772, 1806,
               1654, 1689, 1897, 1608))

dd6.ts = ts(data=dd5, start=c(2006,1), frequency = 4)
dd6.ts

plot(dd6.ts, main = "Permanent Change Random Variable Time Series")


graphics.off()                    # 그래프 지워주는 함수.

############################################################결과값(print)#################################################################

# 
# > dd6 = matrix(c(1342, 1442, 1252, 1343,   1425, 1362, 1456, 1272,
#                  +                1243, 1359, 1812, 1653,   1601, 1878, 1772, 1806,
#                  +                1654, 1689, 1897, 1608))
# > 
#   > dd6.ts = ts(data=dd5, start=c(2006,1), frequency = 4)
# > dd6.ts
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1812 1653
# 2009 1601 1878 1772 1806
# 2010 1654 1689 1897 1608
# > 
#   > plot(dd6.ts, main = "Permanent Change Random Variable Time Series")

##########################################################################################################################################
