##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


### 시계열 자료의 구간 누적 그래프 : cpgram

# 우연변동의 시계열(dd1) 및 계절변동의 시계열(dd2) 분석

dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,
               1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
               1254, 1289, 1497, 1208))

(dd.ts1 =ts(data = dd1, start = c(2006,1), frequency = 4))                      # 우연변동 시계열(dd1).

dd2 = matrix(c(1142, 1242, 1452, 1543,  1125, 1262, 1456,1572,
               1143, 1259, 1462, 1553,  1121, 1258, 1472, 1546,
               1154, 1249, 1477, 1548))

(dd.ts2 =ts(data = dd2, start = c(2006,1), frequency = 4))                      # 계절변동 시계열(dd2).


ts.plot(dd1, main = "Random Variation Time Series")

ts.plot(dd2, main = "Seasonal Variation Time Series")

cpgram(dd1, main = "Cumulative Periodogram : dd1")

cpgram(dd2, main = "Cumulative Periodogram : dd2")


# 분석결과 : 자료의 구간 그래프 누적은 코드를 돌려보면 알 수 있음.
# 우연 변동의 경우 지속적 계단형을 보이는 반면, 계절 변동의 경우 f=0.25에서 큰 변화를 보임.


graphics.off()                                                                # 그래프를 지워주는 함수.


############################################################결과???(print)#################################################################


#***출력???***


# > dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,
# +               1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
# +               1254, 1289, 1497, 1208))
# > 
#   > (dd.ts1 =ts(data = dd1, start = c(2006,1), frequency = 4))                  
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208
# > dd2 = matrix(c(1142, 1242, 1452, 1543,  1125, 1262, 1456,1572,
#                  +                1143, 1259, 1462, 1553,  1121, 1258, 1472, 1546,
#                  +                1154, 1249, 1477, 1548))
# > 
#   > (dd.ts2 =ts(data = dd2, start = c(2006,1), frequency = 4))                   
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1142 1242 1452 1543
# 2007 1125 1262 1456 1572
# 2008 1143 1259 1462 1553
# 2009 1121 1258 1472 1546
# 2010 1154 1249 1477 1548
# 
# > ts.plot(dd1, main = "Random Variation Time Series")
# > ts.plot(dd2, main = "Seasonal Variation Time Series")
# 
# > cpgram(dd1, main = "Cumulative Periodogram : dd1")
# > cpgram(dd2, main = "Cumulative Periodogram : dd2")
# 
# > graphics.off()   

##########################################################################################################################################