##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################

### 구간별 그래프프(monthplot) .

# 구간별 변동 그래프 그리기

dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,     
               1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
               1254, 1289, 1497, 1208))

(dd.ts1 =ts(data = dd1, start = c(2006,1), frequency = 4))            # 우연변동 자료(dd1).    

dd2 = matrix(c(1142, 1242, 1452, 1543,  1125, 1262, 1456,1572,
               1143, 1259, 1462, 1553,  1121, 1258, 1472, 1546,
               1154, 1249, 1477, 1548))

(dd.ts2 =ts(data = dd2, start = c(2006,1), frequency = 4))            # 계절변동 자료(dd2).          


ts.plot(dd1, main = "Random Variation Time Series")

ts.plot(dd2, main = "Seasonal Variation Time Series")

cpgram(dd1, main = "Cumulative Periodogram : dd1")

cpgram(dd2, main = "Cumulative Periodogram : dd2")


graphics.off()                                                                



############################################################출력값(print)#################################################################

# [Workspace loaded from ~/.RData]
# 
# > dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,
#                  +                1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
#                  +                1254, 1289, 1497, 1208))
# > 
#   > (dd.ts1 =ts(data = dd1, start = c(2006,1), frequency = 4))                      
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208
# > dd2 = matrix(c(1142, 1242, 1452, 1543,  1125, 1262, 1456,1572,
#                  +                1143, 1259, 1462, 1553,  1121, 1258, 1472, 1546,
#                  +                1154, 1249, 1477, 1548))
# > 
#   > (dd.ts2 =ts(data = dd2, start = c(2006,1), frequency = 4))                      
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1142 1242 1452 1543
# 2007 1125 1262 1456 1572
# 2008 1143 1259 1462 1553
# 2009 1121 1258 1472 1546
# 2010 1154 1249 1477 1548
# > 
#   > 
#   > ts.plot(dd1, main = "Random Variation Time Series")
# > 
#   > ts.plot(dd2, main = "Seasonal Variation Time Series")
# > 
#   > cpgram(dd1, main = "Cumulative Periodogram : dd1")
# > 
#   > cpgram(dd2, main = "Cumulative Periodogram : dd2")

##########################################################################################################################################
