##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### Cosine Taper: Cosine Bell 함수 적용사례.

# Cosine Bell 함수를 적용하여 시계열 자료의 양 극단값을 0에 가깝게 조정하는 법. 


.libPaths("C://Users//yjang//R")                                              # 저장 디렉토리 및 lib 경로 설정.

install.packages("forecast")

library(forecast)

dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,
               1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
               1254, 1289, 1497, 1208))

(dd1.ts =ts(data = dd1, start = c(2006,1), frequency = 4))                      # 우연변동 자료(dd1).

ddb.ts = spec.taper(dd1.ts, p=0.1)

plot(ddb.ts, main = "Taper a Time Series by a Cosine Bell:ddb")


dd4 = matrix(c(1142, 1242, 1452, 1543,  1225, 1362, 1556,1672,
               1343, 1459, 1662, 1753,  1421, 1558, 1772, 1846,
               1554, 1649, 1877, 1948))

(dd4.ts =ts(data = dd4, start = c(2006,1), frequency = 4))                      # 계절, 추세 변동 자료(dd4).

ddc.ts = spec.taper(dd4.ts, p=0.1)

plot(ddc.ts, main = "Taper a Time Series by a Cosine Bell: ddc")


ts.plot(dd1, main = "Random Variation Time Series")

ts.plot(dd4, main = "Seasonal Trend Variation Time Series")


graphics.off()                                                                 # 그래프 지워주는 함수.

############################################################결과값(print)#################################################################


#***출력값***


# > dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,
# +                1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
# +                1254, 1289, 1497, 1208))
# > 
#   > (dd1.ts =ts(data = dd1, start = c(2006,1), frequency = 4))                      # 우연변동 자료(dd1).
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208
# > 
#   > ddb.ts = spec.taper(dd1.ts, p=0.1)
# > plot(ddb.ts, main = "Taper a Time Series by a Cosine Bell:ddb")
# > dd4 = matrix(c(1142, 1242, 1452, 1543,  1225, 1362, 1556,1672,
#                  +                1343, 1459, 1662, 1753,  1421, 1558, 1772, 1846,
#                  +                1554, 1649, 1877, 1948))
# > 
#   > (dd4.ts =ts(data = dd4, start = c(2006,1), frequency = 4))                      # 계절, 추세 변동 자료(dd4).
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1142 1242 1452 1543
# 2007 1225 1362 1556 1672
# 2008 1343 1459 1662 1753
# 2009 1421 1558 1772 1846
# 2010 1554 1649 1877 1948
# > 
#   > ddc.ts = spec.taper(dd4.ts, p=0.1)
# > plot(ddc.ts, main = "Taper a Time Series by a Cosine Bell: ddc")

# > graphics.off()   

##########################################################################################################################################