##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


###  "decompose", "tsdisplay": 요소분해법 및 ACF, PACF 적용 사례

# 시계열 자료에 대하여 tsdisplay에 의한 요소분해법 등의 그래프를 작성.

# 시계열 요소 분해법이란 시계열 자료는 변동들의 혼합(결합)으로 이루어지는 것이므로 시계열자료를 형성하고 있는 변동요소를 
# 찾아내고 시계열 자료를 그 요소들로 표현하여 예측


library(forecast)

dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,
               1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
               1254, 1289, 1497, 1208))

(dd1.ts =ts(data = dd1, start = c(2006,1), frequency = 4))                      # 우연변동 시계열(dd1).

decompose(dd1.ts)                                                               # 요소분해 적용.

tsdisplay(dd1.ts, main="Time Series Display: dd1.ts")


graphics.off()                                                                  # 그래프를 지워주는 함수.


# tsdisplay를 적용하면, 시계열 자료 "dd1" 그래프 및 자기상관 함수 ACF(Autocorrelation function),
# 부분 자기상관 함수(PACF, Partial Autocorrelation Function) 그래프가 작성

# 분석사례의 ACF 및 PACF 그래프에서 점선 추정값은 95% 신뢰구간 범위를 나타냄.

# 우연변동 시계열 자료 "dd1" 는 자기상관이 없는 것으로 판단.


############################################################결과값(print)#################################################################

# > library(forecast)
# > 
#   > dd1 = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456,1272,
#                    +                1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
#                    +                1254, 1289, 1497, 1208))
# > 
#   > (dd1.ts =ts(data = dd1, start = c(2006,1), frequency = 4))                      # 우연변동 시계열(dd1).
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208
# > 
#   > decompose(dd1.ts)                                                               # 요소분해 적용.
# $x
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208
# 
# $seasonal
# Qtr1      Qtr2      Qtr3      Qtr4
# 2006 -50.88281  36.92969  24.21094 -10.25781
# 2007 -50.88281  36.92969  24.21094 -10.25781
# 2008 -50.88281  36.92969  24.21094 -10.25781
# 2009 -50.88281  36.92969  24.21094 -10.25781
# 2010 -50.88281  36.92969  24.21094 -10.25781
# 
# $trend
# Qtr1     Qtr2     Qtr3     Qtr4
# 2006       NA       NA 1355.125 1355.500
# 2007 1371.000 1387.625 1356.000 1332.875
# 2008 1327.000 1319.125 1311.500 1321.125
# 2009 1324.750 1332.625 1358.375 1341.375
# 2010 1339.625 1336.750       NA       NA
# 
# $random
# Qtr1        Qtr2        Qtr3        Qtr4
# 2006          NA          NA -127.335938   -2.242188
# 2007  104.882812  -62.554688   75.789062  -50.617188
# 2008  -33.117188    2.945312   76.289062  -57.867188
# 2009  -72.867188  108.445312  -60.585938   74.882812
# 2010  -34.742188  -84.679688          NA          NA
# 
# $figure
# [1] -50.88281  36.92969  24.21094 -10.25781
# 
# $type
# [1] "additive"
# 
# attr(,"class")
# [1] "decomposed.ts"
# > 
#   > tsdisplay(dd1.ts, main="Time Series Display: dd1.ts")


##########################################################################################################################################