##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### 시계열 데이터의 자료 속성: class, start, end, frequency, cycle, tsp

# R에서 수행되는 시계열 데이터 자료의 속성 파악.

dd = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456, 1272,
              1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
              1254, 1289, 1497, 1208))

dd.ts = ts(data = dd, start = c(2006,1), frequency = 4)
dd.ts                                                            # 입력된 자료의 출력.


class(dd.ts)                                                     # 시계열 자료의 class.

start(dd.ts)                                                     # 시계열 자료 시작시간. 

end(dd.ts)                                                       # 시계열 자료 종료시간.

frequency(dd.ts)                                                 # 시계열 자료 구분(주기).

window(dd.ts, c(2007,2), c(2008,3))                              # 시계열 자료 추출(2007,2분기부터 2008, 3분기까지.)

cycle(dd.ts)                                                     # 시계열 자료의 주기.

tsp(dd.ts)                                                       # 시계열 자료의 개요 (시작시간, 종료시간, 주기.)


graphics.off()                    # 그래프 지워주는 함수.

############################################################결과값(print)#################################################################

# # 
# > dd = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456, 1272,
#                 +               1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
#                 +               1254, 1289, 1497, 1208))
# > 
#   > dd.ts = ts(data = dd, start = c(2006,1), frequency = 4)
# > dd.ts                                                            # 입력된 자료의 출력.
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208
# > 
#   > 
#   > class(dd.ts)                                                     # 시계열 자료의 class.
# [1] "ts"
# > 
#   > start(dd.ts)                                                     # 시계열 자료 시작시간. 
# [1] 2006    1
# > 
#   > end(dd.ts)                                                       # 시계열 자료 종료시간.
# [1] 2010    4
# > 
#   > frequency(dd.ts)                                                 # 시계열 자료 구분(주기).
# [1] 4
# > 
#   > window(dd.ts, c(2007,2), c(2008,3))                              # 시계열 자료 추출(2007,2분기부터 2008, 3분기까지.)
# Qtr1 Qtr2 Qtr3 Qtr4
# 2007      1362 1456 1272
# 2008 1243 1359 1412     
# > 
#   > cycle(dd.ts)                                                     # 시계열 자료의 주기.
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006    1    2    3    4
# 2007    1    2    3    4
# 2008    1    2    3    4
# 2009    1    2    3    4
# 2010    1    2    3    4
# > 
#   > tsp(dd.ts)                                                       # 시계열 자료의 개요 (시작시간, 종료시간, 주기.)
# [1] 2006.00 2010.75    4.00



##########################################################################################################################################