##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### 시계열 데이터의 자료의 기본적인 연산.

# 시계열 데이터 자료의 기본적인 연산은 일반적으로 수행되는 행렬연산과 비슷함.

# 일반 그래프 작성 프로그램은 "plot", 시계열 자료는 " ts.plot"을 이용.
# legend: 그래프의 "범례에 해당"
# lty = Line type.


(zz = ts(matrix(1:24, 8, 3),s=c(2001,1), f=4, n=c("a","b","c")))    # 분석용 시계열 데이터 자료 구성.
                                                                    # 1 ~ 24까지 일련 자료 적용
                                                                    # matrix, column = 8, row = 3
                                                                    # 시작시간 s=2001, 1분기 , frequency= 4 , 이름은 n="a","b","c".


class(zz)                                                           # class: mts = multiple time series 시계열, ts = time series. 

(z1 = zz[,"a"])                                                     # n = "a" 자료만 추출.

(z2 = zz[,"a"] + zz[,"b"])                                          # n = "a" 자료와 n="b" 자료의 합.

(z3 = zz[,"a"]^2 / zz[,"b"])                                        # n = "a" 자료 제곱 / n="b" 자료

ts.plot(zz, lty=1:3, main="Multiple Time Series Data")

legend("bottomright", c("a","b","c", lty=1:3))

graphics.off()                                                      # 그래프 지워주는 함수.

############################################################결과값(print)#################################################################

# # > (zz = ts(matrix(1:24, 8, 3),s=c(2001,1), f=4, n=c("a","b","c")))
# a  b  c
# 2001 Q1 1  9 17
# 2001 Q2 2 10 18
# 2001 Q3 3 11 19
# 2001 Q4 4 12 20
# 2002 Q1 5 13 21
# 2002 Q2 6 14 22
# 2002 Q3 7 15 23
# 2002 Q4 8 16 24

# > class(zz)
# [1] "mts"    "ts"     "matrix"
# > (z1 = zz[,"a"])
# Qtr1 Qtr2 Qtr3 Qtr4
# 2001    1    2    3    4
# 2002    5    6    7    8
# > (z2 = zz[,"a"] + zz[,"b"])
# Qtr1 Qtr2 Qtr3 Qtr4
# 2001   10   12   14   16
# 2002   18   20   22   24
# > 
#   > (z3 = zz[,"a"]^2 / zz[,"b"])
# Qtr1      Qtr2      Qtr3      Qtr4
# 2001 0.1111111 0.4000000 0.8181818 1.3333333
# 2002 1.9230769 2.5714286 3.2666667 4.0000000
# > 
#   > ts.plot(zz, lty=1:3, main="Multiple Time Series Data")
# > 
#   > legend("bottomright", c("a","b","c", lty=1:3))


##########################################################################################################################################