##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### Box Cox 변환.

# 시계열 자료의 특수한 변환을 나타내는 방식.


# .libPaths("C://Users//yjang//R")    # 저장 디렉토리 및 lib 경로 설정.

install.packages("forecast")

library(forecast)

dd = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456, 1272,      # 행렬 생성.
              1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
              1254, 1289, 1497, 1208))

dd.ts = ts(data=dd, start=c(2006,1), frequency = 4)

dd.ts                                                              # 입력 자료


lambda = BoxCox.lambda(dd.ts) 

lambda

new=BoxCox(dd.ts,lambda)

new


ss = (dd.ts^lambda-1)/lambda

ss

InvBoxCox(new,lambda)

graphics.off()                                       # 그래프 지워주는 함수.

############################################################결과값(print)#################################################################



# 에러

# > library(forecast)
# Error: package or namespace load failed for ‘forecast’ in inDL(x, as.logical(local), as.logical(now), ...):
#   unable to load shared object 'C:/Users/yjang/R/Rcpp/libs/x64/Rcpp.dll':
#   LoadLibrary failure:  지정된 프로시저를 찾을 수 없습니다.
# In addition: Warning message:
#   패키지 ‘forecast’는 R 버전 4.0.2에서 작성되었습니다 

# > library(forecast)
# Registered S3 method overwritten by 'quantmod':
#   method            from
# as.zoo.data.frame zoo 
# 
# > dd = matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456, 1272,
#                 +               1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
#                 +               1254, 1289, 1497, 1208))
# 
# > dd.ts = ts(data=dd, start=c(2006,1), frequency = 4)
# 
# > dd.ts                              # 입력 자료
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208
# 
# > lambda = BoxCox.lambda(dd.ts) 
# 
# > lambda
# [1] 1.999924
# 
# > new=BoxCox(dd.ts,lambda)
# 
# > new
# Qtr1      Qtr2      Qtr3      Qtr4
# 2006  900024.5 1039148.1  783357.8  901366.2
# 2007 1014792.1  927049.7 1059423.0  808584.2
# 2008  772136.4  922970.4  996361.7  784609.6
# 2009  720840.0 1091679.1  873399.0  987912.3
# 2010  785862.5  830340.9 1119926.0  729267.0
# 

# > ss = (dd.ts^lambda-1)/lambda

# > ss
# Qtr1      Qtr2      Qtr3      Qtr4
# 2006  900024.5 1039148.1  783357.8  901366.2
# 2007 1014792.1  927049.7 1059423.0  808584.2
# 2008  772136.4  922970.4  996361.7  784609.6
# 2009  720840.0 1091679.1  873399.0  987912.3
# 2010  785862.5  830340.9 1119926.0  729267.0

# > InvBoxCox(new,lambda)
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208






##########################################################################################################################################
