##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### 시계열 자료의 교집합: ts.intersect

# frequency가 같은 복수의 시계열 자료에 대하여, 공통부분을 수행할 경우 적용되는 프로그램은 "ts.intersect".

# 이는 집합에서 "교집합 - n"에 해당되며, 자료가 없을 경우에는 공집합으로 나타내지 않음.

zz1=ts(matrix(1:24,8,3), s=c(2001,1),f=4,n=c("a","b","c"))                     # 시계열 자료 1.

zz1

zz2=ts(matrix(11:22,4,3), s=c(2002,1),f=4,n=c("a","b","c"))                    # 시계열 자료 2.
zz2


intersect(zz1,zz2)                                                             # 일반적 교집합 

ts.intersect(zz1,zz2)                                                          # 시계열 자료 교집합.



zz3=ts(matrix(21:32,4,3), s=c(2003,1), f=4, n=c("a","b","c"))                  # 시계열 자료 3.

ts.intersect(zz2, zz3)                                                         # 교집합 결과 없음.


graphics.off()                                       # 그래프 지워주는 함수.

############################################################결과값(print)#################################################################

# # > zz1=ts(matrix(1:24,8,3), s=c(2001,1),f=4,n=c("a","b","c"))                     # 시계열 자료 1.
# > 
#   > zz1
# a  b  c
# 2001 Q1 1  9 17
# 2001 Q2 2 10 18
# 2001 Q3 3 11 19
# 2001 Q4 4 12 20
# 2002 Q1 5 13 21
# 2002 Q2 6 14 22
# 2002 Q3 7 15 23
# 2002 Q4 8 16 24
# > 
#   > zz2=ts(matrix(11:22,4,3), s=c(2002,1),f=4,n=c("a","b","c"))                    # 시계열 자료 2.
# > zz2
# a  b  c
# 2002 Q1 11 15 19
# 2002 Q2 12 16 20
# 2002 Q3 13 17 21
# 2002 Q4 14 18 22
# > 
#   > 
#   > intersect(zz1,zz2)                                                             # 일반적 교집합 
# [1] 11 12 13 14 15 16 17 18 19 20 21 22
# > 
#   > ts.intersect(zz1,zz2)                                                          # 시계열 자료 교집합.
# zz1.a zz1.b zz1.c zz2.a zz2.b zz2.c
# 2002 Q1     5    13    21    11    15    19
# 2002 Q2     6    14    22    12    16    20
# 2002 Q3     7    15    23    13    17    21
# 2002 Q4     8    16    24    14    18    22
# > 
#   > 
#   > 
#   > zz3=ts(matrix(21:32,4,3), s=c(2003,1), f=4, n=c("a","b","c"))                  # 시계열 자료 3.
# > 
#   > ts.intersect(zz2, zz3)                                                         # 교집합 결과 없음.
# NULL

##########################################################################################################################################