##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


### 지수평활법의 분석 사례

# 단순 지수 평활법 분석사례: 고정된 Alpha 값 적용

# 우연변동 시계열 자료 "dd1"에 대하여 단순 지수 평활법을 수행

# Alpha 값은 0.1을 적용하여 지수평활법 수행.


library(forecast)
library(tsDyn)
library(tseries)
library(mice)

dd1.ts = ts(data=dd1, start=c(2006,1), frequency = 4)
ho=HoltWinters(dd1.ts, alpha = 0.1, beta = F, gamma = F)

ho

ho$fitted


graphics.off()                                                                                          # 그래프를 지워주는 함수.



# 단순 지수 평활법 결과

# 자료의 입력 및 alpha = 0.1을 적용한 지수 평활법 수행결과는 아래와 같음
# 추정결과는 "ho" 파일, "fitted" 변수로 저장.



############################################################결과값(print)#################################################################

# [Workspace loaded from ~/.RData]

# > library(forecast)
# > library(tsDyn)
# > library(tseries)
# > library(mice)
# > dd1.ts = ts(data=dd1, start=c(2006,1), frequency = 4)
# > ho=HoltWinters(dd1.ts, alpha = 0.1, beta = F, gamma = F)
# > ho
# Holt-Winters exponential smoothing without trend and without seasonal component.
# 
# Call:
#   HoltWinters(x = dd1.ts, alpha = 0.1, beta = F, gamma = F)
# 
# Smoothing parameters:
#   alpha: 0.1
# beta : FALSE
# gamma: FALSE
# 
# Coefficients:
#   [,1]
# a 1334.816
# > ho$fitted
# xhat    level
# 2006 Q2 1342.000 1342.000
# 2006 Q3 1352.000 1352.000
# 2006 Q4 1342.000 1342.000
# 2007 Q1 1342.100 1342.100
# 2007 Q2 1350.390 1350.390
# 2007 Q3 1351.551 1351.551
# 2007 Q4 1361.996 1361.996
# 2008 Q1 1352.996 1352.996
# 2008 Q2 1341.997 1341.997
# 2008 Q3 1343.697 1343.697
# 2008 Q4 1350.527 1350.527
# 2009 Q1 1340.775 1340.775
# 2009 Q2 1326.797 1326.797
# 2009 Q3 1341.917 1341.917
# 2009 Q4 1339.926 1339.926
# 2010 Q1 1346.533 1346.533
# 2010 Q2 1337.280 1337.280
# 2010 Q3 1332.452 1332.452
# 2010 Q4 1348.907 1348.907


##########################################################################################################################################