##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인


##########################################################################################################################################


### 추세변동을 고려한 지수 평활법의 분석 사례 : HoltWinters (Gamma=FALSE)

# 추세, 우연변동 시계열 자료 "dd3"에 대한 지수 평활법 분석 

library(forecast)
library(tsDyn)
library(tseries)
library(mice)
library(stats)

# dd3 = matrix(c(1142, 1242, 1252, 1343,   1225, 1562, 1356, 1572,
#                1343, 1459, 1412, 1453,   1401, 1478, 1322, 1606,
#                1554, 1589, 1597, 1408))
# 
# dd3.ts = ts(data=dd3, start=c(2006,1), frequency=4)
# 
# hb= HoltWinters(dd3.ts, gamma = F)
# 
# hb


names(hb)                                                                                               # 분석결과의 구분



hb$SSE                                                                                                  # 잔차의 제곱합



hb$fitted                                                                                               # 분석결과 추정값


# plot(hb)                                                                                                # 분석결과 그래프

graphics.off()                                                                                          # 그래프를 지워주는 함수.


#*************************************************************************************************************************************#


# 분석 결과의 추정

# 추세변동을 고려한 단순 지수 평활법에 따른 추정결과 "hb"는 다음과 같습니다.

# 단순 지수 평활법의 추정결과 "hb"는 총 9개의 종류가 출력됩니다.

# "hb$SSE"는 잔차 제곱합입니다.

# "hb$fitted"는 추정값으로서, 이를 그래프로 나타낼수 도 있습니다.

# 그래프의 붉은 선이 추정값입니다.


############################################################결과값(print)#################################################################

# [Workspace loaded from ~/.RData]
# 
# > library(forecast)
# Registered S3 method overwritten by 'quantmod':
#   method            from
# as.zoo.data.frame zoo 
# > library(tsDyn)
# > library(tseries)
# 
# ‘tseries’ version: 0.10-47
# 
# ‘tseries’ is a package for time series analysis and computational finance.
# 
# See ‘library(help="tseries")’ for details.
# 
# > library(mice)
# 
# 다음의 패키지를 부착합니다: ‘mice’
# 
# The following objects are masked from ‘package:base’:
#   
#   cbind, rbind
# 
# > library(stats)
# 
# 
# > names(hb)                                                                                               # 분석결과의 구분
# [1] "fitted"       "x"            "alpha"        "beta"         "gamma"        "coefficients" "seasonal"     "SSE"          "call"        
# > hb$SSE                                                                                                  # 잔차의 제곱합
# [1] 313861.9
# > 
#   > 
#   > 
#   > hb$fitted                                                                                               
# xhat    level      trend
# 2006 Q3 1342.000 1242.000 100.000000
# 2006 Q4 1401.090 1321.545  79.544957
# 2007 Q1 1454.230 1387.887  66.342382
# 2007 Q2 1416.374 1402.131  14.243450
# 2007 Q3 1496.813 1449.472  47.341020
# 2007 Q4 1480.146 1464.809  15.337325
# 2008 Q1 1537.236 1501.023  36.213638
# 2008 Q2 1485.159 1493.091  -7.932075
# 2008 Q3 1465.336 1479.213 -13.877361
# 2008 Q4 1427.214 1453.214 -25.999469
# 2009 Q1 1412.936 1433.075 -20.138962
# 2009 Q2 1387.371 1410.223 -22.851742
# 2009 Q3 1405.715 1407.969  -2.253836
# 2009 Q4 1365.408 1386.689 -21.280547
# 2010 Q1 1453.490 1420.090  33.400731
# 2010 Q2 1532.578 1476.334  56.244414
# 2010 Q3 1614.470 1545.402  69.067831
# 2010 Q4 1675.597 1610.499  65.097374
# 

# > plot(hb)                                                                                                # 분석결과 그래프


