##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### 시계열 데이터의 자료 형태.

## 우연 변동 시계열(Random Variation Time Series)

.libPaths("C://Users//yjang//R")    # 저장 디렉토리 및 lib 경로 설정.

dd1=matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456, 1272,                       
             1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
             1254, 1289, 1497, 1208))

dd1.ts = ts(data = dd1, start = c(2006,1), frequency = 4)

dd1.ts

plot(dd1.ts, main = "Random Variation Time Series")


# 시계열 자료가 일정한 수준에 머물면서 우연변동(Random Variable, Random Fluctuation 또는 기저변동 Underlying Variation)
# 에 변화만 나타나는 경우.

# 이러한 시계열 수식에서 α는 미지의 모수로서 자료에서 추정.
# 확률오차에 의한 예측이 가능한 시계열 모형으로서, 시계열 자료는 분기별 차이가 없이 일정한 변동폭원만 가지는 상품 판매량, 생산량으로 추정.

# 우연변동 시계열은 R에서 ts로 시계열 자료를 구성한 다음 "plot"으로 수행.

# y_t = α + e_t

############################################################결과값(print)#################################################################

# > dd1=matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456, 1272,
# +              1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
# +              1254, 1289, 1497, 1208))

# > dd1.ts = ts(data = dd1, start = c(2006,1), frequency = 4)

# > dd1.ts
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208

# > plot(dd1.ts, main = "Random Variation Time Series")

##########################################################################################################################################

