##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### 시계열 데이터의 자료 형태.

## 계절변동 시계열.

.libPaths("C://Users//yjang//R")    # 저장 디렉토리 및 lib 경로 설정.

# 시계열 자료는 주기적 성격의 계절적 변동(Seasonal Variation, Seasonal Fluctuation)에 의한 요인에 영향을 받아,
# 주기적인 변화를 나타내는 경우의 시계열 형태.

# 시계열의 수식에서 f는 주기(frequency)이고, α,β는 미지의 모수로서, 자료에서 추정.

# 계절적 변동은 주기적 변화를 나타내는 1년의 월별 변동(Monthly Variation), 1달의 요일별 변동(Weekly Variation), 
# 1일의 시간별 변동(Timely Variation)등으로 세분화.

# 그리고 계절적 변동과 유사하게 주기가 1년 이상이며, 장기적인 시간의 흐름에 따라 주기적으로 변화하는 것은 순환변동(Cyclical Variation).

dd2<-matrix(c(1142,1242,1452, 1543,   1125, 1262, 1456, 1572,
              1143, 1259, 1462, 1553,  1121, 1258, 1472, 1546,
              1154, 1249, 1477, 1548))

dd2.ts = ts (data=dd2, start = c(2006,1), frequency = 4)

dd2.ts

plot(dd2.ts, main = "Seasonal Variation Time Series")

############################################################결과값(print)#################################################################

# > dd1=matrix(c(1342, 1442, 1252, 1343,  1425, 1362, 1456, 1272,
# +              1243, 1359, 1412, 1253,  1201, 1478, 1322, 1406,
# +              1254, 1289, 1497, 1208))

# > dd1.ts = ts(data = dd1, start = c(2006,1), frequency = 4)

# > dd1.ts
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1342 1442 1252 1343
# 2007 1425 1362 1456 1272
# 2008 1243 1359 1412 1253
# 2009 1201 1478 1322 1406
# 2010 1254 1289 1497 1208

# > plot(dd1.ts, main = "Random Variation Time Series")

##########################################################################################################################################
