##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### 시계열 데이터의 자료 형태.

## 추세변동 시계열(Trend Variation Time Series).

# 시간에 따라 증가하거나 또는 감소하는 경향을 보여주는 시계열 형태.
# 이러한 추세변동(Trend Variation, Trend Fluctuation, 경향변동.)

# 수식의 α, β 는  미지의 모수로서 시계열 자료에서 추정.

# 수식의 "α + β1t"는 선형의 추세변동(Linear Trend Variation)을 나타내는 수식.
# 두 번째 수식의 "α + β1t + β2t" 는 2차식의 비선형에 따른 추세변동(Non-Linear Trend variation)을 나타내는 수식.




.libPaths("C://Users//yjang//R")    # 저장 디렉토리 및 lib 경로 설정.


dd3 = matrix(c(1142, 1242, 1252, 1343,   1225, 1562, 1356, 1572,
               1343, 1459, 1412, 1453,   1401, 1478, 1322, 1606,
               1554, 1589, 1597, 1408))

dd3.ts = ts(data=dd3, start=c(2006,1), frequency = 4)
dd3.ts

plot(dd3.ts, main = "Trend Variation Time Series")




############################################################결과값(print)#################################################################

# > dd3 = matrix(c(1142, 1242, 1252, 1343,   1225, 1562, 1356, 1572,
#                  +                1343, 1459, 1412, 1453,   1401, 1478, 1322, 1606,
#                  +                1554, 1589, 1597, 1408))
# > 
#   > dd3.ts = ts(data=dd3, start=c(2006,1), frequency = 4)
# > dd3.ts
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1142 1242 1252 1343
# 2007 1225 1562 1356 1572
# 2008 1343 1459 1412 1453
# 2009 1401 1478 1322 1606
# 2010 1554 1589 1597 1408
# > 
#   > plot(dd3.ts, main = "Trend Variation Time Series")

##########################################################################################################################################
