##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github Time_Series_Analysis/R_Time_Series_Data_Analysis 경로에 issue를 남기면 확인

##########################################################################################################################################


### 시계열 데이터의 자료 형태.

## 계절적 추세변동 시계열 (Seasonal-Trend Variation Time Series)

# 시간에 따라 증가하거나 또는 감소하는 추세변동(Trend Variation)과 주기적인 성격의 계절적 변동(Seasonal Variation)을 동시에 보여주는 
# 시계열 형태. 이러한 계절적 경향변동의 시계열의 수식은 다음과 같이 구성되며, 수식의 α, β 는  미지의 모수로서 시계열 자료에서 추정.

# 수식의 "α + βt"는 선형의 추세변동을 나타내는 수식, 만일 비선형의 추세를 나타낼 경우 비선형의 수식으로 변형 가능.

# 두번째 수식의 " β2 sin(t*) + β3 cos(t*)"는 시계열의 주기성을 나타내는 수식.




.libPaths("C://Users//yjang//R")    # 저장 디렉토리 및 lib 경로 설정.


dd4 = matrix(c(1142, 1242, 1452, 1543,   1225, 1362, 1556, 1672,
               1343, 1459, 1662, 1753,   1421, 1558, 1772, 1846,
               1554, 1649, 1877, 1948))

dd4.ts = ts(data=dd4, start=c(2006,1), frequency = 4)
dd4.ts

plot(dd4.ts, main = "Seasonal Trend Variation Time Series")




############################################################결과값(print)#################################################################

# > plot(dd4.ts, main = "Seasonal Trend Variation Time Series")
# > dd4 = matrix(c(1142, 1242, 1452, 1543,   1225, 1362, 1556, 1672,
#                  +                1343, 1459, 1662, 1753,   1421, 1558, 1772, 1846,
#                  +                1554, 1649, 1877, 1948))
# > 
#   > dd4.ts = ts(data=dd4, start=c(2006,1), frequency = 4)
# > dd4.ts
# Qtr1 Qtr2 Qtr3 Qtr4
# 2006 1142 1242 1452 1543
# 2007 1225 1362 1556 1672
# 2008 1343 1459 1662 1753
# 2009 1421 1558 1772 1846
# 2010 1554 1649 1877 1948
# > 
#   > plot(dd4.ts, main = "Seasonal Trend Variation Time Series")

##########################################################################################################################################
